## Q1. Create a database called temp_db. Open a cursor to this newly created database.

In [1]:
import sqlite3

con = sqlite3.connect('temp_db.db')
cur = con.cursor()

## Q2. In the database temp_db created in Q.No.1, create a table called emp with the attributes empno, ename, salary and deptno\

In [2]:
cur.execute('CREATE TABLE IF NOT EXISTS emp(empno INTEGER,ename TEXT, salary INTEGER,deptno INTEGER)')

## Q3. In the emp table created in Q.No. 2, insert any five records.

In [3]:
def insert(e,n,s,d):
    con = sqlite3.connect('temp_db.db')
    cur = con.cursor()
    cur.execute('INSERT INTO emp values(?,?,?,?)',(e,n,s,d))
    con.commit()
    con.close()

In [4]:
insert(1,'Rose',15000,10)
insert(2,'Mia Madison',20000,20)
insert(3,'Ashley stonegal',25000,30)
insert(4,'Andrew olesten',30000,40)
insert(5,'Danny',35000,50)
insert(6,'Andy sas',35000,60)
insert(7,'Mia cummins',35000,70)
insert(8,'Assli cumms',45000,80)

## Q4. From the emp table, display all the records.

In [5]:
def display():
    cur.execute('SELECT * FROM emp')
    record = cur.fetchall()
    return record

In [6]:
display()

[(1, 'Rose', 15000, 10),
 (2, 'Mia Madison', 20000, 20),
 (3, 'Ashley stonegal', 25000, 30),
 (4, 'Andrew olesten', 30000, 40),
 (5, 'Danny', 35000, 50),
 (6, 'Andy sas', 35000, 60),
 (7, 'Mia cummins', 35000, 70),
 (8, 'Assli cumms', 45000, 80)]

## Q5. From the emp table, display the records of only those employees whose salary is greater than 15000 and who belong to deptno 10

In [7]:
import sqlite3

def display1():
    con = sqlite3.connect('temp_db.db')
    cur = con.cursor()
    cur.execute('SELECT * FROM emp WHERE salary > 15000 and deptno==10')
    result = cur.fetchall()
    con.commit()
    #con.close()
    return result
    
display1()

[]

## Q6. From the emp table, display the records of only those employees whose salary lies between 20000 and 25000 and who do not belong to the deptno 10

In [8]:
import sqlite3

def display1():
    con = sqlite3.connect('temp_db.db')
    cur = con.cursor()
    cur.execute('SELECT * FROM emp WHERE salary BETWEEN 20000 and 25000 and deptno != 10')
    result = cur.fetchall()
    con.commit()
    con.close()
    return result
    
display1()

[(2, 'Mia Madison', 20000, 20), (3, 'Ashley stonegal', 25000, 30)]

## Q7. From the emp table, display the records of only those employees whose name begins with M.

In [9]:
def display2():
    con = sqlite3.connect('temp_db.db')
    cur = con.cursor()
    cur.execute('SELECT * FROM emp WHERE ename LIKE "M%" ORDER BY ename')
    result = cur.fetchall()
    con.commit()
    con.close()
    return result
    
display2()

[(2, 'Mia Madison', 20000, 20), (7, 'Mia cummins', 35000, 70)]

## Q8. In the emp table, delete the records of those employees who belong to deptno 30

In [10]:
def delete():
    cur.execute('DELETE FROM emp WHERE deptno==30')

In [11]:
delete()

In [12]:
display()

[(1, 'Rose', 15000, 10),
 (2, 'Mia Madison', 20000, 20),
 (4, 'Andrew olesten', 30000, 40),
 (5, 'Danny', 35000, 50),
 (6, 'Andy sas', 35000, 60),
 (7, 'Mia cummins', 35000, 70),
 (8, 'Assli cumms', 45000, 80)]

## Q9. In the emp table, update the salary of an employee by 10 % by accepting the empno from the user.

In [13]:
def update(e):
    cur.execute('UPDATE emp SET salary=salary+(salary*10/100) WHERE empno=?',(e,))

In [15]:
update(5)

In [16]:
display()

[(1, 'Rose', 15000, 10),
 (2, 'Mia Madison', 20000, 20),
 (4, 'Andrew olesten', 30000, 40),
 (5, 'Danny', 38500, 50),
 (6, 'Andy sas', 35000, 60),
 (7, 'Mia cummins', 35000, 70),
 (8, 'Assli cumms', 45000, 80)]

## Q10. Delete the emp table.

In [17]:
def delete1():
    cur.execute('DELETE FROM emp')

In [18]:
delete1()

In [19]:
display()

[]